import React from "react";

export default function MyModal4({visible, onClose}) {
    
    if(!visible) return null;
  return (

    <div  id="container" className="fixed inset-0 bg-black bg-opacity-25 backdrop-blur-sm flex items-center justify-center z-30 overflow-y-scroll">
      <div className="bg-white p-2 rounded w-[1200px] h-auto mt-20  ">
       
        

      <p class="text-gray-700 text-base ">
      
      विद्वद्वरेण्य श्री गोविन्दाचार्य जी का सम्पूर्ण जीवन संस्कृत एवं संस्कृति को समर्पित रहा। आपके जीवन का उद्देश्य था- शिक्षा, सेवा तथा साधना। तदनुसार शिक्षा के अन्तर्गत वेद, वेदांग, वेदान्त, दर्शन आदि के साथ विशिष्टाद्वैतसिद्धान्त सहित प्राच्यविद्याओें के एक हजार से अधिक प्रकाण्ड विद्वान् बनाने का लक्ष्य लेकर श्रीनिवास सेवार्थ न्यास एवं श्रीनिवास संस्कृत विद्यापीठम् के माध्यम से दिल्ली, चण्डीगढ, जयपुर आदि 10 स्थलों में शैक्षणिक संस्थाएँ (गुरुकुल) संस्थापित की, जहाँ 300 से ज्यादा छात्रें को अध्ययन, आवास, भोजन, उपचार आदि व्यवस्था निःशुल्क दे रहे हैं ताकि भारतीय संस्कृति एवं संस्कृत के सुयोग्य पुरोधा तैयार होकर देश व समाज को ट्टषिमुनियों के संस्कार प्रदान कर सकें। न केवल आध्यात्मिक शिक्षा अपितु अंग्रेजी, कम्प्यूटर तथा संगीत आदि लौकिक शिक्षा का भी अध्ययन-अध्यापन होता है। इसी प्रकार सेवा के अन्तर्गत- कामधेनु वंश की गौमाता की रक्षा हेतु श्रीनिवास गौशाला भी संचालित है, जिसमें अनेक गोवंश का भरण-पोषण हो रहा है। तथा एक निःशुल्क धर्मार्थ आयुर्वेदिक औषधालय का संचालन हो रहा हैं। तत्पश्चात् साधना के अन्तर्गत- आपने श्रीनिवास संस्कृत विद्यापीठम् के प्राघõण में ही श्री वेघड्ढटेश मन्दिर का निर्माण करवाया, जहाँ भगवान् श्रीनिवास वेघड्ढटेश (तिरुपति बाला जी) की प्राणप्रतिष्ठा के बाद भगवान् 	की नित्य आराधना चल चल रही है। श्री गोविन्दाचार्य जी ने अनेक आश्रमों तथा गुरुकुलों का संचालन एवं सामाजिक कार्यों के अलावा अपना अनमोल समय ग्रन्थ निर्माण, कला एवं संगीत, प्रवचन, व्याख्यान पर भी दिया। उसके अन्तर्गत छात्रेपयोगी अनेक ग्रन्थों का लेखन, सम्पादन तथा अनुवाद किया है तथा आपके द्वारा लिखित कई ग्रन्थ अनेक संस्कृत विश्वविद्यालयों के पाठड्ढक्रम में भी निर्धारित हैं। 
	आप संस्कृत जगत् में ख्यातिप्राप्त संस्कृत व्याकरण, वेदान्त तथा धर्मशास्त्र के मूर्धन्य विद्वान रहे तथा अपने 36 वर्षों के अध्यापनकाल में अनेक छात्रें का भविष्य निर्माण किया। आपके द्वारा पढ़ाए गए कुछ छात्र आज जगद्गुरु पद पर अधिष्ठित हैं तो कई छात्र महाविद्यालय तथा विश्वविद्यालय में व्याख्याता आदि पदों पर हैं। कई छात्र विभिÂ विश्वविद्यालयों में शोधकार्यरत हैं। आपके द्वारा लिखित व व्याख्यात 20 से अधिक पुस्तकों के लगभग 22,000 पृष्ठ प्रकाशित हो चुके हैं तथा इसके अतिरिक्त 21,000 से अधिकपृष्ठ तथा ग्रन्थों का कार्य कम्प्यूटर में हो चुका है तथा प्रकाशन के अधीन हैं।
	आपको आचार्य शंकर पुरस्कार, संस्कृत सेवा सम्मान, पाणिनि सम्मान, जन सेवक सम्मान, ट्टषि सम्मान, गोपालोपायनम्-पुरस्कार इत्यादि पुरस्कार एवं सम्मान सरकार तथा विभिÂ संस्थाओं द्वारा प्राप्त हैं। आपने पत्रकारिता के क्षेत्र में भी उल्लेखनीय कार्य किया है। लक्ष्यचिन्तन, योगालोक, वंशी, संस्कृत संवाद तथा संस्कृतवाणी पत्र-पत्रिकाओं के प्रकाशन व सम्पादन कार्य 1998 से निरन्तर करते आ रहे हैं। 
	यद्यपि प्रमाणपत्र आदि अभिलेखों में आपका नाम गोविन्द प्रसाद शर्मा है तथापि श्रीगोविन्दाचार्य नाम से आपकी प्रसिद्धि रही।
	ऐसे संस्कृत एवं संस्कृति के परमसेवक तथा परमभागवत श्रीगोविन्दाचार्य जी ने 30 नवम्बर 2020 को इहलोक त्यागकर श्रीवैकुण्ठ में भगवान् के परमसायुज्य को प्राप्त किया-
सायुज्यं समवाप्य नन्दति चिरं तेनैव धन्यः पुमान्।
	आपके शिक्षा एवं दीक्षा के आचार्य (गुरु)- उभयवेदान्ताचार्य अनन्तश्रीविभूषित 	 श्रीनिवास मुक्तिनारायण रामानुज जीयर (श्रीधराचार्य) स्वामीजी 	 महाराज (षडाचार्य, त्रिदण्डी स्वामीजी)
	आपकी माता जी- श्रीमती भूदेवी शर्मा जी 
	आपके पिता जी- श्रीमान् भीमप्रसाद शर्मा (भागवताचार्य)।
	उच्चशिक्षा आचार्य (व्याकरण व वेदान्त विषय में) सम्पूर्णानन्द संस्कृत विश्वविद्यालय, वाराणसी व भारतीयविद्याभवन, नई दिल्ली।
	शिक्षण अनुभव - 1- आप 20 वर्ष की अवस्था से वेद, वेदान्त, वेदांग का अध्यापन कर रहे हैं। 27 वर्ष की उम्र्र में अयोध्या में श्रीनिवास-बोधायन-रामानुज-संस्कृत-महाविद्यालय में व्याकरण-विभागाध्यक्ष (भ्व्क्ए टलांंतंद) के पद पर सीधे आपकी विश्वविद्यालय से नियुक्ति हुई।
	2- अयोध्या में अपने लक्ष्य प्रति सीमित क्षेत्र होने के कारण छह साल के बाद आप अपनी सरकारी नौकरी छोड़कर दिल्ली पधारे। प्रभु-कृपा तथा आचार्य-प्रेरणास्वरूप अपने सुयोग्य गुरुभ्राता के साथ मिलकर श्रीमती लक्ष्मीदेवी कनोडियाजी, हास्यकवि श्रीसुरेन्द्रशर्मा जी एवं श्री अशोककनोडिया जी आदि महानुभावों के सहयोग से दिल्ली के कुदसियाघाट के अन्तर्गत मारवाड़ीघाट पर श्रीमुक्तिनाथपीठवेदविद्याश्रम की स्थापना करके वर्ष 1999 से वेद, वेदांग, वेदान्त का पठन-पाठन शुरू किया। तत्पश्चात् अनेक गुरुकुल बनाये गये, जो आज एक बहुत बड़ा वटवृक्ष तैयार हो गया है।
	3- आप 2004 से दिल्ली के बुराड़ी क्षेत्र के इब्राहिमपुर गांव में श्रीनिवास सेवार्थ न्यास व श्रीनिवास संस्कृत विद्यापीठम् की स्थापना करके अहर्निश सारस्वत साधना में संलग्न हैं। जून 1999 से लेकर दिसम्बर 2017 तक आपके मार्गदर्शन, संस्थापकत्व एवं संचालकत्व में संचालित विभिन्न शिक्षण संस्थाओं की प्रगति यह है कि 7 छात्र च्ीण्क (विद्यावारिधि) की उपाधि प्राप्त कर चुके हैं। लगभग 50 छात्र शोध में पंजीकृत हैं। 100 से अधिक छात्र (ठण्मक) (शिक्षाशास्त्री) कर चुके हैं और कई छात्र अभी प्रशिक्षणरत हैं। इसी तरह 200 से ज्यादा छात्रें ने आचार्य (डण्। ) की उपाधि प्राप्त कर ली है और अभी 300 से अधिक छात्र विभिन्न कक्षाओं में अध्ययनरत हैं। मुख्यशाखा दिल्ली की है और इसमें सबसे अधिक लगभग 70 छात्र होते हैं।  
स्वामी गोविन्दाचार्य जी द्वारा लिखित तथा 
सम्पादित ग्रन्थ व पुस्तकें, पद एवं पुरस्कार
û-	पाणिनीय व्याकरणस्यैतिहासिकं परिशीलनम् (संस्कृत में)	
ü- नित्यानुसन्धानम् (हिन्दी अनुवाद सहित)
ý-	वैयाकरणसिद्धान्तकौमुदी की श्रीधरमुखोल्लासिनी हिन्दी विस्तृत व्याख्या 
	(6 भागों में प्रकाशित, 7वाँ प्रेस में)
þ-	ट्टजुसिद्धान्तकौमुदी मूल एवं हिन्दी में व्याख्या)		
ÿ- सारसिद्धान्तकौमुदी (हिन्दी व्याख्या)
ö-	तर्कसंग्रह (श्रीनिवासमुखोल्लासिनी संस्कृत एवं श्रीधरमुखोल्लासिनी हिन्दीव्याख्या)
झ्-	लघुसिद्धान्तकौमुदी पर श्रीधरमुखोल्लासिनी व्याख्या (हिन्दी व्याख्या)
ø-	सुदर्शनानुष्ठानम् (पूजा एवं हवन विधि, संस्कृत व्याख्या एवं हिन्दी व्याख्या)
ù-	गीतार्थसंग्रह की रक्षा टीका की श्रीधरमुखोल्लासिनी व्याख्या (हिन्दी व्याख्या)
ûú-	 नित्यानुसन्धानम्, सम्पादन (स्तोत्र संग्रह, नेपाली भाषा में अनुवाद सहित) 
ûû- श्रीनिवासस्तोत्रमाला (स्तोत्र संग्रह) का सम्पादन
ûü- नक्षत्रनुसारि श्रीविष्णुसहस्रनामानुष्ठानम्	
ûý- श्रीधनुर्मासोत्सव (श्रीगोदाम्बाव्रत)
ûþ- श्रीरामानुजाचार्य (संक्षिप्त जीवन वृत्त)
आचार्यश्रीजी के प्रकाशोन्मुख ग्रन्थः-
ûÿ-	 श्रीसम्प्रदाय: एक परिचय
	(श्रीवैष्णव-सम्प्रदाय के समग्र रूप से परिचय कराने वाला बृहद् ग्रन्थ)
ûö- संक्षिप्तो विशिष्टाद्वैतकोशः (विशिष्टाद्वैत दर्शन के लगभग 8000 शब्द)
ûö- श्रीरामानुजग्रन्थाः (एकजिल्द में श्रीरामानुजाचार्यस्वामीजी के सभी ग्रन्थों का 		 सम्पादन)
ûझ्-	 वेदार्थसंग्रह (हिन्दी व्याख्या श्रीधरमुखोल्लासिनी)	
ûø- ब्रह्मसूत्रसारः (हिन्दी व्याख्या)
ûù-	 वेदान्तदीपः (श्रीधरमुखोल्लासिनी हिन्दी व्याख्या)	
üú-	 वेदान्तसारः (हिन्दी व्याख्या) 
üû-	 श्रीभाष्यम् (श्रीधरमुखोल्लासिनी हिन्दी व्याख्या)		
üü- ब्रह्मसूत्र-त्रिविधार्थः (द्वैत, अद्वैत और विशिष्टाद्वैत सम्मत व्याख्या के अनुसार 		 हिन्दी में ब्रह्मसूत्रें का सरल अर्थ)
üý- कौमुदीप्रवेशः
üþ-	 पाणिनीयाष्टाध्यायी की श्रीधरमुखोल्लासिनी व्याख्या	
üÿ-	 संस्कृत व्याकरण का परिचय
üö-	 श्रीम७ागवतमहापुराण की श्रीधरी टीका की हिन्दी व्याख्या (सात भागों में)
üझ्-	 पाणिनीयवादरत्नम् की हिन्दी व्याख्या		    
üø- मध्यसिद्धान्तकौमुदी हिन्दी व्याख्या
üù-	 अष्टाध्यायी पर ट्टजुकाशिका व्याख्या 8 भागों में।
ýú- श्रीरामानुजाचार्यस्वामिविरचित नित्यग्रन्थ का सम्पादन व प्रकाशन।
30- श्रीवेदान्तदेशिकविरचित तत्त्वमुक्ताकलाप पर हिन्दी व्याख्या
31- प×चस्तवी का हिन्दी अनुवाद।
33- श्रीयामुनाचार्यस्वामी जी के आगमप्रामाण्यम् का सम्पादन व प्रकाशन।
33-	श्रीमद्-भगवद्-गीता पर श्रीरामानुजभाष्य-सहित पदच्छेद, अन्वय, शब्दार्थ व 		व्याख्या।
पद, पुरस्कार एवं सम्मानः-
1- भूत पूर्व विभागाध्यक्ष (व्याकरण) सम्पूर्णानन्द संस्कृत विश्वविद्यालय, 		वाराणसी से सम्बद्ध श्रीनिवास बोधायन रामानुज संस्कृत महाविद्यालय, 
	उत्तर तोताद्रिमठ, अयोध्या।
2-	भूतपूर्व सदस्य, दिल्ली संस्कृत अकादमी (दिल्ली सरकार)
3-	सदस्य- श्रीगोस्वामीगिरिधारलालशास्त्री प्राच्यविद्या प्रतिष्ठान, दिल्ली सरकार।
4- 	संस्कृत सेवा सम्मान (दिल्ली संस्कृत अकादमी, दिल्ली सरकार)
5-	पाणिनि सम्मानः (दिल्ली संस्कृत अकादमी, दिल्ली सरकार)
6- विद्यासागर उपाधि (मन्दाकिनी विद्वत्परिषत्, दिल्ली द्वारा) सम्मान
7- ऋषि-सम्मान (श्री शंकर शिक्षायतन, नई दिल्ली)
8-	आचार्य शंकर पुरस्कार (श्रीशंकराचार्यजी, विश्व कल्याण मिशन) 
9- सवश्रेष्ठ-धर्मोपासक सम्मान (श्रीवैष्णो सेवा मण्डल चेरिटेबल ट्रस्ट)
10- 	 जन सेवक सम्मान ( वेद फाउण्डेशन, दिल्ली)
 </p>

        <div className="text-center">
          <button   className="px-5 py-2 bg-blue-700 text-white rounded">
Donate Now   
  </button>
          <button  onClick={onClose} className="px-5 py-2 bg-red-700 text-white rounded ml-5">
            Close         
             </button> 
        </div>
      </div>
    </div>
  );
}